Revit 2024 API
Subelement.UniqueId Property
 A stable unique identifier for this subelement within the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public string UniqueId { get; }
Visual Basic
Public ReadOnly Property UniqueId As String
	Get
Visual C++
public:
property String^ UniqueId {
	String^ get ();
}
See Also
Subelement Class
Autodesk.Revit.DB Namespace